import React from 'react';
import './Critaria.css';
const Critaria = () => {
    return (
        <div className='critaria-container'>
           <div className="how-to-work-react">
                <h4>How To Work React</h4>
                <p>রিয়াক্ট খুব পাওয়ারফুল একটী লাইব্রেরি,রিয়াক্ট ভার্চুয়াল ডম তৈরির মাধ্যমে খুব দ্রুত কাজ করতে পারে। মূল ডমের একটি কপি নেই আবার যখন ডমের কোন ডাটা পরিবর্তন করা হয় তখন আবার আর একটি ভার্চুয়াল ডম বানানো হয়য় এবং ২টির সাথে তুলনা করা হয়য় কোথায় চেঞ্জ করা হয়েছে এবং পরে রিয়াল ডমের চেঞ্জকৃত জাইগা আবার পরিবর্ত্ন করে দেই,এই কাজটা মূলত করে ডিফ এলগরিদম এর মাধ্যমে,ফলে সকল ডম কে আবার জেনারেট করতে হয়না ।</p>
           </div>
           <div className="difference-props-and-state">
                <h4>Difference Between Props And State</h4>
                <p>প্রপস হচ্ছে রিড অনলি একে পরিবর্তন করা জাই না, অন্যদিকে স্টেট পরিবর্তন ও হতে পারে আবার নাও হতে পারে । প্রপস কে মডিফাই করা জাইনা কিন্তু স্টেট কে মডিফাই করা জাই । স্টেট এসিঙ্কোনাস ভাবে পরিবর্তন হয়ে থাকে । প্রপস এর সাহায্যে খুব সহজে কোন কম্পোনেণ্টে ডাটা পাঠানো যায় । আর স্টেট এর সাহায্যে খুব সহজে কোন ভ্যালু পরিবর্তন করা জাই ।</p>
           </div>
           <div className="useEffect-data-load">
                <h4>useEffect Where using</h4>
                <p>কেন আমরা  useEffect ব্যবহার করি?
যদি আমরা সরাসরি আমাদের কম্পোনেন্ট বডিতে কোনো useEffect করি, তাহলে তা আমাদের প্রতিক্রিয়া উপাদানের রেন্ডারিংয়ের পথে বাধা হয়ে দাঁড়ায়। useEffect রেন্ডারিং প্রক্রিয়া থেকে পৃথক করা উচিত. যদি আমাদের একটি পার্শ্ব প্রতিক্রিয়া সঞ্চালনের প্রয়োজন হয়, আমাদের উপাদান রেন্ডার হওয়ার পরে এটি কঠোরভাবে করা উচিত। এটিই ইউজ ইফেক্ট আমাদের দেয়।</p>
           </div>
        </div>
    );
};

export default Critaria;